RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/timer_reg.h
    /* 0x18 : Timer2 Match Value 2 */
    union {
        struct {
            uint32_t tmr2_2 : 32; /* [31: 0],        r/w, 0xffffffff */
        } BF;
        uint32_t WORD;
    } TMR2_2;

    /* 0x1C : Timer3 Match Value 0 */
    union {
        struct {
            uint32_t tmr3_0 : 32; /* [31: 0],        r/w, 0xffffffff */
        } BF;
        uint32_t WORD;
    } TMR3_0;

    /* 0x20 : Timer3 Match Value 1 */
    union {
        struct {
            uint32_t tmr3_1 : 32; /* [31: 0],        r/w, 0xffffffff */
        } BF;
        uint32_t WORD;
    } TMR3_1;

    /* 0x24 : Timer3 Match Value 2 */
    union {
        struct {
            uint32_t tmr3_2 : 32; /* [31: 0],        r/w, 0xffffffff */
        } BF;
        uint32_t WORD;
    } TMR3_2;

    /* 0x28  reserved */
    uint8_t RESERVED0x28[4];

    /* 0x2C : Timer2 Counter Value */
    union {
        struct {
            uint32_t tcr2_cnt : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } TCR2;

    /* 0x30 : Timer3 Counter Value */
    union {
        struct {
            uint32_t tcr3_cnt : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } TCR3;

    /* 0x34  reserved */
    uint8_t RESERVED0x34[4];

    /* 0x38 : Timer2 Match Status */
    union {
        struct {
            uint32_t tsr2_0        : 1;  /* [    0],          r,        0x0 */
            uint32_t tsr2_1        : 1;  /* [    1],          r,        0x0 */
            uint32_t tsr2_2        : 1;  /* [    2],          r,        0x0 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TSR2;

    /* 0x3C : Timer3 Match Status */
    union {
        struct {
            uint32_t tsr3_0        : 1;  /* [    0],          r,        0x0 */
            uint32_t tsr3_1        : 1;  /* [    1],          r,        0x0 */
            uint32_t tsr3_2        : 1;  /* [    2],          r,        0x0 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TSR3;

    /* 0x40  reserved */
    uint8_t RESERVED0x40[4];

    /* 0x44 : Timer2 Match Interrupt Enable */
    union {
        struct {
            uint32_t tier2_0       : 1;  /* [    0],        r/w,        0x0 */
            uint32_t tier2_1       : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tier2_2       : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TIER2;

    /* 0x48 : Timer3 Match Interrupt Enable */
    union {
        struct {
            uint32_t tier3_0       : 1;  /* [    0],        r/w,        0x0 */
            uint32_t tier3_1       : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tier3_2       : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TIER3;

    /* 0x4c  reserved */
    uint8_t RESERVED0x4c[4];

    /* 0x50 : Timer2 Pre-Load Value */
    union {
        struct {
            uint32_t tplvr2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } TPLVR2;

    /* 0x54 : Timer3 Pre-Load Value */
    union {
        struct {
            uint32_t tplvr3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } TPLVR3;

    /* 0x58  reserved */
    uint8_t RESERVED0x58[4];

    /* 0x5C : Timer2 Pre-Load Control */
    union {
        struct {
            uint32_t tplcr2        : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_31 : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TPLCR2;

    /* 0x60 : Timer3 Pre-Load Control */
    union {
        struct {
            uint32_t tplcr3        : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_31 : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TPLCR3;

    /* 0x64 : Watch-dog reset/interrupt Mode */
    union {
        struct {
            uint32_t we            : 1;  /* [    0],        r/w,        0x0 */
            uint32_t wrie          : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_31 : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WMER;

    /* 0x68 : Watch-dog Match Value */
    union {
        struct {
            uint32_t wmr            : 16; /* [15: 0],        r/w,     0xffff */
            uint32_t wdt_align      : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31 : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WMR;

    /* 0x6C : Watch-dog Counter Value */
    union {
        struct {
            uint32_t wdt_cnt        : 16; /* [15: 0],          r,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WVR;

    /* 0x70 : Watch-dog Reset Status */
    union {
        struct {
            uint32_t wts           : 1;  /* [    0],          w,        0x0 */
            uint32_t reserved_1_31 : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WSR;

    /* 0x74  reserved */
    uint8_t RESERVED0x74[4];

    /* 0x78 : Timer2 Interrupt Clear */
    union {
        struct {
            uint32_t tclr2_0       : 1;  /* [    0],          w,        0x0 */
            uint32_t tclr2_1       : 1;  /* [    1],          w,        0x0 */
            uint32_t tclr2_2       : 1;  /* [    2],          w,        0x0 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TICR2;

    /* 0x7C : Timer3 Interrupt Clear */
    union {
        struct {
            uint32_t tclr3_0       : 1;  /* [    0],          w,        0x0 */
            uint32_t tclr3_1       : 1;  /* [    1],          w,        0x0 */
            uint32_t tclr3_2       : 1;  /* [    2],          w,        0x0 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TICR3;

